#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azuread_application.ACR-access-app: Refreshing state... [id=60141773-f66e-48e9-ae59-e2a8e0bdddbb]
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=4d02d6f1-0a23-46e7-9e4b-67fe15ccc9d2-d8d61e78-2b84-48fa-8ab3-818bf9b582cc-a41c4bdc-c09b-4493-b4c0-11971219a839]
github_actions_secret.github-acr-access-app-id: Refreshing state... [id=Project-F:SP_APPID]
azuread_service_principal.ACR-access-sp: Refreshing state... [id=971fe105-22f0-4111-aa48-eeddad6cece1]
azurerm_resource_group.rg-projectf-prod-001: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-projectf-prod-001]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-09-20 22:47:52.927721532 +0000 UTC]
azurerm_resource_group.rg-projectf-prod-002: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-projectf-prod-002]
azurerm_container_registry.acr-prod: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-projectf-prod-002/providers/Microsoft.ContainerRegistry/registries/acrprojectfprod001]
github_actions_secret.github-docker-server-name: Refreshing state... [id=Project-F:DOCKER_SERVER]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_service_principal_password.ACR-access-sp-password will be created
  + resource "azuread_service_principal_password" "ACR-access-sp-password" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = "971fe105-22f0-4111-aa48-eeddad6cece1"
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # azurerm_role_assignment.acr-role-assignment-prod will be created
  + resource "azurerm_role_assignment" "acr-role-assignment-prod" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "971fe105-22f0-4111-aa48-eeddad6cece1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-projectf-prod-002/providers/Microsoft.ContainerRegistry/registries/acrprojectfprod001"
      + skip_service_principal_aad_check = true
    }

  # github_actions_secret.github-acr-access-app-password will be created
  + resource "github_actions_secret" "github-acr-access-app-password" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Project-F"
      + secret_name     = "SP_PASSWORD"
      + updated_at      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*